{
    "www.bbc.com_news_articles_cw008xgn49po_20241026_223539_GMT": [
        "Elon Musk has unexpectedly asked a California court to withdraw a legal case against OpenAI and its CEO Sam Altman, which accused OpenAI and Sam Altman of abandoning OpenAI's founding mission of developing artificial intelligence (AI) for humanity's benefit.",
        "The filing submitted by Elon Musk's lawyers asked for the months-old legal case against OpenAI and Sam Altman to be dropped without offering any reason for the move.",
        "Elon Musk's request to withdraw the legal case against OpenAI and Sam Altman came just a day before the California court was expected to hear OpenAI's bid to have the case dismissed.",
        "BBC News has contacted Elon Musk's lawyer and OpenAI for comment.",
        "The latest filing submitted by the lawyers of Elon Musk asked for the case's dismissal \"without prejudice\", meaning Elon Musk could still reactivate the case at a later stage.",
        "Elon Musk, the Tesla boss, filed the lawsuit against OpenAI at the end of February this year, arguing that OpenAI, the company he had helped found in 2015, had deviated from its altruistic goals to focus on making money.",
        "OpenAI countered that Elon Musk had previously backed the idea of a for-profit structure and even suggested a merger with his electric car firm Tesla.",
        "The feud between Mr Musk and OpenAI intensified earlier this week after Apple unveiled a partnership with OpenAI to boost Apple's Siri voice assistant and operating systems with OpenAI's ChatGPT chatbot.",
        "After the announcement of the partnership between Apple and OpenAI, Elon Musk posted several messages on his social media platform X, formerly known as Twitter, criticizing the tie-up.",
        "One of the posts by Mr Musk ended with the words: \"Apple has no clue what’s actually going on once Apple hands your data over to OpenAI.\"",
        "Mr Musk is saying that Apple is selling consumers down the river.",
        "However, investors seemed to welcome the news regarding the tie-up, as Apple's stock market value rose to a record high above $3 trillion.",
        "Mr. Musk started his own AI company, called xAI, in July 2023, which Mr. Musk said would aim to \"understand reality.\"",
        "In November 2023, xAI launched Grok, a chatbot with \"a little humour\", in a bid to rival the likes of ChatGPT."
    ],
    "www.hollywoodreporter.com_business_business-news_elon-musk-sues-openai-ceo-lawsuit-challenging-microsoft-partnership-1235963903__20241026_225114_GMT": [
        "Elon Musk is reigniting a legal battle against OpenAI over OpenAI's for-profit pivot, this time looking to void OpenAI's partnership with Microsoft.",
        "Elon Musk filed a lawsuit in the Northern District of California on Monday, alleging fraud and breach of contract over claims that Elon Musk was swindled when Elon Musk invested roughly $45 million into the AI venture, which Elon Musk says betrayed its original mission to safely develop the technology \"for the benefit of humanity.\"",
        "In Elon Musk's telling, chief executive Sam Altman illegally partnered with Microsoft to establish a web of illicit affiliates and plunder OpenAI's nonprofit arm of assets and staff in violation of their deal.",
        "Elon Musk seeks a court order invalidating OpenAI’s exclusive license with Microsoft that gives Microsoft unique access to the underlying code of GPT-4, as well as treble damages and disgorgement of profits attributed to Elon Musk's investments in OpenAI.",
        "The lawsuit names Sam Altman, Greg Brockman, and dozens of subsidiaries.",
        "In Hollywood, the utilization of artificial intelligence tools in the production pipeline is positioned to be the next battleground between creators and studios.",
        "With the introduction of Sora, capable of creating hyperrealist videos with a prompt of just a couple sentences, OpenAI is courting the Hollywood industry amid the rise of AI technology.",
        "Marc Toberoff, a lawyer for Elon Musk, who regularly sues studios on behalf of creators to claw back the copyrights to their works, stresses that AI tools — if controlled by a handful of companies, like OpenAI and Microsoft — threaten talent.",
        "Marc Toberoff says this case is about far more than money; the future of Artificial General Intelligence (AGI) lies in the balance.",
        "AI tools are increasingly being adopted in concept art, visual effects, and postproduction amid belt-tightening, displacing some workers.",
        "Elon Musk’s ties to OpenAI can be traced back to 2015, when Elon Musk cofounded OpenAI among a group of other prominent Silicon Valley investors.",
        "The lawsuit points to messages from Sam Altman as proof that Sam Altman defrauded Elon Musk, who was told in an email, \"The technology would be owned by the foundation and used ‘for the good of the world.'",
        "Per its certificate of incorporation, a legal document relating to the formation of OpenAI, OpenAI said it \"will seek to open source technology for the public benefit.\"",
        "OpenAI adds that OpenAI will not be organized for the private gain of any one person and that no part of the net income or assets of OpenAI shall ever inure to the benefit of any director, officer, or member.",
        "OpenAI stated that the company will seek to open source technology for the public benefit and that the corporation will not be organized for the private gain of any one person, ensuring that no part of the net income or assets of OpenAI shall ever inure to the benefit of any director, officer, or member.",
        "The lawsuit details Microsoft’s early courtship of OpenAI while Elon Musk was still with OpenAI.",
        "In 2016, Microsoft, led by Satya Nadella, offered to sell 'Compute' to OpenAI at a steep discount if OpenAI would agree to publicly promote Microsoft’s products, according to the complaint.",
        "The lawsuit states that Elon Musk wrote to Sam Altman, \"This actually made me feel nauseous.\"",
        "Satya Nadella wrote that the situation sucks and is exactly what he would expect from Microsoft.",
        "Later that year, Microsoft and OpenAI announced a partnership giving OpenAI access to Microsoft’s latest technology for running large-scale AI training.",
        "But after Elon Musk left the board in 2018 due to a potential conflict of interest with Tesla, which Elon Musk owns and was ramping up its focus on AI, Elon Musk claims Sam Altman directed OpenAI to form numerous for-profit entities.",
        "The partnership between Microsoft and OpenAI includes OpenAI, L.P., which was established as a \"capped-profit company.\"",
        "Musk claims Sam Altman directed OpenAI to form numerous for-profit entities.",
        "With the creation of the for-profit arm of OpenAI, Sam Altman allegedly transferred the nonprofit division’s staff and assets to the new company.",
        "OpenAI’s dozens of other affiliates were woven into OpenAI's corporate web for the purpose of profiting from the nonprofit’s assets as part of a shell game, the lawsuit says.",
        "The complaint states to just follow the money.",
        "The nonprofit’s 2022 IRS tax return showed just $44,485.00 in revenue, but one year later, OpenAI reportedly generated hundreds of millions of dollars overall.",
        "Musk also alleges that Sam Altman withheld and misrepresented information to the OpenAI board, going as far as to lie in some business dealings.",
        "In discussions with the nonprofit, Sam Altman allegedly claimed to be an independent board member of OpenAI Startup Fund while omitting that Sam Altman owns the company.",
        "Other instances of alleged self-dealing by Sam Altman include OpenAI’s partnership with Reddit in a deal in which the social media platform’s content can be shown on ChatGPT, as well as a $51 million chip deal with Rain, another company in which Sam Altman is a significant shareholder, according to the complaint.",
        "And currently, on information and belief, OpenAI is hammering out a deal with Helion Energy (in which Sam Altman owns a massive stake) for Helion Energy to buy vast quantities of electricity to power OpenAI's data centers,\" the lawsuit states.",
        "On \"The TED AI Show\" podcast, former OpenAI board member Helen Toner, who was a part of ousting Sam Altman in November before Sam Altman was reinstated, said: \"Sam Altman had made it really difficult for the OpenAI board to\" fulfill its mission to safely develop the technology by \"in some cases, outright lying.\"",
        "The lawsuit claims Elon Musk seized control of OpenAI’s board alongside Microsoft to further undermine safety guardrails, with the goal of maximizing profits.",
        "The filing of the complaint follows Elon Musk in June dropping a similar lawsuit against OpenAI and Sam Altman without explanation.",
        "Elon Musk has openly criticized OpenAI for abandoning its original structure.",
        "Last year, Elon Musk founded xAI, which has since reached a valuation of $24 billion.",
        "Elon Musk is represented by Toberoff, who is widely considered among the entertainment industry’s preeminent copyright termination lawyers.",
        "Musk has brought lawsuits on behalf of the estate of Steve Ditko, who co-created Spider-Man and Doctor Strange, the heirs to the writer of the magazine story that spawned Top Gun, and Lance Hill, who wrote the screenplay for Road House."
    ]
}