{
    "www.bbc.com_news_articles_cw008xgn49po_20241026_223539_GMT": {
        "article_found": true,
        "title": "Elon Musk unexpectedly drops case against OpenAI",
        "publication_date": "11 June 2024",
        "author": "João da Silva",
        "publisher": "BBC News",
        "body_text": "Elon Musk has unexpectedly asked a California court to withdraw a legal case against OpenAI and its boss Sam Altman, which accused them of abandoning the firm's founding mission of developing artificial intelligence (AI) for humanity's benefit.\n\nThe filing submitted by the multi-billionaire's lawyers asked for the months-old case to be dropped without offering any reason for the move.\n\nIt came just a day before the court was expected to hear the ChatGPT-developer's bid to have the case dismissed.\n\nBBC News has contacted Mr Musk's lawyer and OpenAI for comment.\n\nThe latest filing asked for the case's dismissal \"without prejudice\", meaning Mr Musk could still reactivate it at a later stage.\n\nThe Tesla boss filed the lawsuit against OpenAI at the end of February this year, arguing the company he had helped found in 2015 had deviated from its altruistic goals to focus on making money.\n\n\nOpenAI countered that Mr Musk had previously backed the idea of a for-profit structure and even suggested a merger with his electric car firm Tesla.\n\nThe feud intensified earlier this week after Apple unveiled a partnership with OpenAI to boost its Siri voice assistant and operating systems with OpenAI's ChatGPT chatbot.\n\nAfter the announcement, Mr Musk posted several messages on his social media platform X, formerly known as Twitter, criticising the tie-up.\n\nOne of the posts ended with the words: \"Apple has no clue what’s actually going on once they hand your data over to OpenAI. They’re selling you down the river.\"\n\nHowever, investors seemed to welcome the news, as Apple's stock market value rose to a record high above $3tn.\n\nMr Musk started his own AI company, called xAI, in July 2023, which he said would aim to \"understand reality\".\n\nIn November that year, xAI launched Grok, a chatbot with \"a little humour\", in a bid to rival the likes of ChatGPT."
    }
}